IDENTIFICATION DIVISION.
PROGRAM-ID. ARRAY-ARITHMETIC-ERR.

DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 ARRAY-STRINGS.
      05 ARRAY-ITEM PIC X(3) VALUE "Hi!" OCCURS 5 TIMES INDEXED BY I.

PROCEDURE DIVISION.
PERFORM OUR-DISP VARYING I FROM 1 BY 1 UNTIL I>5
MOVE 'NEW' TO ARRAY-ITEM(1).
DISPLAY "Now loop with 'NEW' taking place of array[1]".
PERFORM OUR-DISP VARYING I FROM 1 BY 1 UNTIL I>5
MOVE .9  TO ARRAY-ITEM(1).
DISPLAY "Now loop with '.9' taking place of array[1]".
PERFORM OUR-DISP VARYING I FROM 1 BY 1 UNTIL I>5

STOP RUN.



OUR-DISP.
DISPLAY ARRAY-ITEM(I).
