*> PROGRAM CODE FOR HELLO WORLD
*> Names: SEAN WILLIAMS MICHAEL GLENN AARON VALENZUELA
IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.

PROCEDURE DIVISION.
DISPLAY "Hello World!"
STOP RUN.
